In [54]:
import pandas as pd
import numpy as np
data = {'color' : ['blue', 'green', 'yellow', 'red', 'white'], 'object' : ['ball', 'pen', 'pencil', 'paper', 'mug'], 'price' : [1.2, 1.0, 0.6, 0.9, 1.7]}
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [55]:
frame2 = pd.DataFrame(data, columns=['object', 'price'])
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [56]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),
    index=['red', 'blue',
'yellow', 'white'],
    columns=['ball', 'pen',
'pencil', 'paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [57]:
frame.columns

Index(['color', 'object', 'price'], dtype='object')

In [58]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [59]:
frame.values

array([['blue', 'ball', 1.2],
       ['green', 'pen', 1.0],
       ['yellow', 'pencil', 0.6],
       ['red', 'paper', 0.9],
       ['white', 'mug', 1.7]], dtype=object)

In [60]:
frame['price']

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [61]:
frame.loc[2]

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [62]:
frame.loc[[2,4]]

    color  object  price
2  yellow  pencil    0.6
4   white     mug    1.7

In [63]:
frame[0:1]

  color object  price
0  blue   ball    1.2

In [64]:
frame[1:3]

    color  object  price
1   green     pen    1.0
2  yellow  pencil    0.6

In [65]:
frame['object'][3]

'paper'

In [66]:
frame.index.name = 'id'
frame.columns.name = 'item'
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    0.6
3        red   paper    0.9
4      white     mug    1.7

In [67]:
frame['new'] = 12
frame

item   color  object  price  new
id
0       blue    ball    1.2   12
1      green     pen    1.0   12
2     yellow  pencil    0.6   12
3        red   paper    0.9   12
4      white     mug    1.7   12

In [68]:
ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [69]:
frame['new'] = ser
frame

item   color  object  price  new
id
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    0.6    2
3        red   paper    0.9    3
4      white     mug    1.7    4

In [70]:
frame['price'][2] = 3.3

C:\Users\Тома\AppData\Local\Temp\ipykernel_14288\3868814400.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame['price'][2] = 3.3

In [71]:
frame.isin([1.0,'pen'])

item  color  object  price    new
id
0     False   False  False  False
1     False    True   True   True
2     False   False  False  False
3     False   False  False  False
4     False   False  False  False

In [72]:
del frame['new']
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    3.3
3        red   paper    0.9
4      white     mug    1.7

In [73]:
frame[frame['price'] < 1.2]

item  color object  price
id
1     green    pen    1.0
3       red  paper    0.9

In [74]:
nestdict = {'red': { 2012: 22, 2013: 33},
            'white': { 2011: 13, 2012: 22, 2013: 16},
            'blue': { 2011: 17, 2012: 27, 2013: 18}}
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [75]:
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [76]:
ser = pd.Series([5,0,3,8,4],
index=['red','blue','yellow','white','green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [77]:
ser.idxmin()
ser.idxmax()

'white'

In [78]:
serd = pd.Series(range(6), index=['white','white','blue','green', 'green','yellow'])
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [79]:
serd['white']

white    0
white    1
dtype: int64

In [80]:
serd.index.is_unique

False

In [81]:
frame.index.is_unique

True

In [82]:
frame.add(frame2)

      blue color object  price  red  white
0      NaN   NaN    NaN    NaN  NaN    NaN
1      NaN   NaN    NaN    NaN  NaN    NaN
2      NaN   NaN    NaN    NaN  NaN    NaN
3      NaN   NaN    NaN    NaN  NaN    NaN
4      NaN   NaN    NaN    NaN  NaN    NaN
2011   NaN   NaN    NaN    NaN  NaN    NaN
2012   NaN   NaN    NaN    NaN  NaN    NaN
2013   NaN   NaN    NaN    NaN  NaN    NaN

In [83]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
            index=['red', 'blue', 'yellow', 'white'],
            columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [84]:
ser = pd.Series(np.arange(4),
index=['ball','pen','pencil','paper'])
ser

ball      0
pen       1
pencil    2
paper     3
dtype: int32

In [85]:
frame - ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [86]:
ser['mug'] = 9
ser

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int32

In [87]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
display(df)

   col1  col2
0     1     3
1     2     4

In [88]:
df = pd.DataFrame([ [1,2,3], [2,3,4] ],
                  columns = ['foo', 'bar', 'baz'],
                  index = ['foobar', 'foobaz'])
display(df)

        foo  bar  baz
foobar    1    2    3
foobaz    2    3    4